awslogs
awscli
aws-shell
dldash/core/docker-color-output
# a better z
#zoxide
# a better dig
dog
# reverse:installed via pip
httpie
# a better diff
difftastic
# a better top
zenith
choose
git-delta
duf
interactive-rebase-tool
jump
starship
procs
fd
sd 
mkcert
git
# prefer nvm.fish
# node
vim
fish
openssl
wget 
ffmpeg
netcat 
nmap 
iftop
jq
yq 
telnet 
grc
graphviz
glow
nmap
mdcat
xmp
xz
htop
mycli
lsd
rargs
prettyping
ripgrep
golang
bat
icdiff
maven
ant
docker-ls
docker-clean
dive
hey
vegeta
kubernetes-cli
helm
kubectx
hyperkit
stern
linkerd
helmsman
terraform
adoptopenjdk
aerial
plantuml
brooklyn
transmission
syntax-highlight
imageoptim
tinypng4mac
iina
#insomnia
skitch
#emby-server
suspicious-package
#cakebrew
dust
interactive-rebase-tool
broot
rustscan
hyperfine
#runjs
docker-credential-helper
docker
# 4 kns kctx interactive mode
fzf
fx
