jump
starship
procs
fd
sd 
mkcert
git
# prefer nvm.fish
# node
vim
fish
openssl
wget 
ffmpeg
netcat 
nmap 
iftop
jq
yq 
telnet 
grc
graphviz
glow
nmap
mdcat
xmp
xz
htop
mycli
lsd
rargs
prettyping
ripgrep
ncdu
golang
bat
icdiff
maven
ant
docker-ls
docker-clean
dive
hey
vegeta
kubernetes-cli
helm
kubectx
minikube
hyperkit
stern
linkerd
helmsman
terraform