orefalo/g2
orefalo/free
orefalo/javahome
orefalo/grc
oh-my-fish/plugin-ssh
oh-my-fish/plugin-wifi-password
laughedelic/brew-completions
barnybug/docker-fish-completion
brgmnn/fish-docker-compose
evanlucas/fish-kubectl-completions
patrickf3139/Colored-Man-Pages
laughedelic/pisces
markcial/cprintf
jorgebucaran/fish-bax
jorgebucaran/nvm.fish