orefalo/fisherman-imp-theme
fisherman/g2
fisherman/free
fisherman/javahome
fisherman/grc
oh-my-fish/ssh
oh-my-fish/fasd
oh-my-fish/wifi-password
laughedelic/brew-completions
barnybug/docker-fish-completion
brgmnn/fish-docker-compose
kubectl-completions
patrickf3139/Colored-Man-Pages
laughedelic/pisces
oh-my-fish/weather
