## DB CLI =====

# search social life
sherlock

# better than man! installs tldr (which is not maintained anymore)
tlrc

# fnm is a better nvm in rsh
fnm

# a better jq, sql based
kiki-ki/tap/qo
# a universal db cli
# xo/xo/usql
# a redis cli
iredis
# a better psql
pgcli
# a better cli for mysql & mariadb
mycli

## LOAD TESTING =====

# a good load tester
ddosify/tap/ddosify
# oha is a great wrk2 alternative, now there is even wrk3
oha

## PROCESS MGMT =====

# modern ps replacement
procs
# a better top
mactop

## K8s =====

# ns switched
blendle/blendle/kns
k9s
robscott/tap/kube-capacity
kubernetes-cli
helm
kubectx
stern
# a superset of helm with mighty powers
helmsman
popeye
# chart & k8s yaml linter
kube-linter

# an better alternative to helm 4
nelm
# from the same vendor, a consistent cicd pipeline
werf

## DOCKER =====

# run this command to complete setup mkdir -p ~/.docker/cli-plugins && ln -sfn $(brew --prefix)/opt/docker-compose/bin/docker-compose ~/.docker/cli-plugins/docker-compose
colima
docker
docker-compose
docker-credential-helper

# color output for docker
dldash/core/docker-color-output
# Dockerfile linter
hodalint
docker-ls
docker-clean
# inspect docker image layers from the cli
dive

## GOLANG =====

#tinygo-org/tools/tinygo
golang

## JAVA =====

maven
ant

### JSON & YAML =====

# a json viewer for the cli
fx
# jq for yaml
yq
# jaq is a jq replacement
jaq
#jq

## GIT =====

git
# https://github.com/MitMaro/git-interactive-rebase-tool
interactive-rebase-tool
# a better diff
# replaced with difftastic
# icdiff
# difftastic
git-delta

## SSL =====

# simplifies the creation of certs/keys
mkcert
openssl

## CLI & SUBSTITUTIONS =====

# replaced with xh + alias
# httpie - a better curl
xh
# a better wget, suppors http/s,s/ftp, torrent
aria2
# widget library for cli
gum
# a vi replacement
vim
# a cool shell
fish
# a better dig
dog
# choose
# a better find
fd
sd
# that's a better du -f
dust
# a better du
duf
# better ping
# prettyping
gping
# better grep
# ripgrep
# grep alternatives
ugrep
regex
# a better xargs
rargs
# better cat
bat
# a better ls
lsd
# a better tree
# broot # not a big fan

## CLI ENHANCEMENTS =====

# regex rename
rnr

# remove dev junk - https://github.com/tbillington/kondo
kondo
# great color prompt
starship
# cli benchmark tool
hyperfine
# hex viewer
hexyl
# like z just better
jump
# markdown for cli
glow
# Modern Day Portscanner
rustscan
# 4 kns kctx interactive mode
# fzf -> replaced with fzy
# a good fuzzy searcher
fzy
# za compression format
xz
# cli p2p file sharing
croc
# terminal recorder
asciinema
# file dupes finder
jdupes
# colorizer
# grc - retired for rust package cgrc
# better nmap
rustscan
# cli git recorder
t-rec
# json <-> yaml <-> tom
yj
# code -> screenshot.png
silicon
# bandwhich is a CLI utility for displaying current network utilization by process, connection and remote IP or hostname.
bandwhich
# regex builder! https://github.com/pemistahl/grex
grex

## OTHERS =====

# a tui for ldap
ericschmar/tap/moribito

# cli progress in one line
progressline

#pipe viewer, and progress
pv

# img to txt cli
chafa
# edge queue on steroids
nats-server
# nats jetstream cli tool (ie. nats bench)
nats-io/nats-tools/nats

# only-switch
ffmpeg
telnet
# graphviz
hashicorp/tap/terraform
# aerial
plantuml
transmission
syntax-highlight
imageoptim
iina
suspicious-package
